---
kind: other
id: Events.T:Autodesk.Revit.DB.Macros.ApplicationEntryPoint
source: html/ad472ec5-fa9b-0564-e0ed-f998d3fa8f32.htm
---
# ApplicationEntryPoint Events

Subscribe to this event to get notified after the Revit application has been initialized